vinhlephu-lpv/robot-ws/src/esp32_source/code0409/code0409.ino
  if (currentDirection == "ROS") {
    v_left  = (rosTargetRpmSigned[0] < 0) ? -fabsf(v_left) : fabsf(v_left);
    v_right = (rosTargetRpmSigned[2] < 0) ? -fabsf(v_right) : fabsf(v_right);
  } else {
    if (slew[0].target < 0) v_left  = -fabsf(v_left);
    if (slew[2].target < 0) v_right = -fabsf(v_right);
  }

  if (!isMoving || (fabsf(enc[0].rpm) < 1.0f && fabsf(enc[1].rpm) < 1.0f)) v_left = 0.0f;
  if (!isMoving || (fabsf(enc[2].rpm) < 1.0f && fabsf(enc[3].rpm) < 1.0f)) v_right = 0.0f;

  // Giao thức ODOM chuẩn ROS 2 (m/s) để tương thích ngược
  Serial.printf("ODOM %.3f %.3f\n", v_left, v_right);

  // Giao thức ENC 4 bánh (ticks & dt_ms)
  unsigned int dt_ms = (unsigned int)(dt * 1000.0f + 0.5f);
  Serial.printf("ENC %ld %ld %ld %ld %u\n", enc[0].count, enc[1].count, enc[2].count, enc[3].count, dt_ms);

  updateWheelHealth();
  updatePID(dt);
}

void updateWheelHealth() {
  if (!isMoving) {
    for (int i = 0; i < 4; i++) wHealth[i] = {false, 0};
    return;
  }
  unsigned long now = millis();

  for (int i = 0; i < 4; i++) {
#if WHEEL3_ENCODER_FAULT
    if (i == 3) { wHealth[3] = wHealth[2]; continue; }
#endif
    float rpm = abs(enc[i].rpm);
    int   pwm = abs(slew[i].target);

    // Phát hiện kẹt cứng cơ khí / hỏng encoder
    if (pwm > STALL_PWM_THRESHOLD && rpm < STALL_RPM_THRESHOLD) {
      if (wHealth[i].stallStartTime == 0) wHealth[i].stallStartTime = now;
      if (now - wHealth[i].stallStartTime > STALL_DETECT_MS && !wHealth[i].isStalled) {
        wHealth[i].isStalled = true;
        Serial.printf("[HEALTH] CANH BAO: Banh %d bi KHOA/HONG!\n", i + 1);
      }
    } else {
      wHealth[i].stallStartTime = 0;
      wHealth[i].isStalled = false;
    }
  }
}

// ============================================================
//  8. THUẬT TOÁN PID + TORQUE BOOST + ĐỒNG BỘ 4 BÁNH
// ============================================================
void updatePID(float dt) {
  if (!pidGlobalEnabled || !isMoving) return;

  float actualRPM[4];
  for (int j = 0; j < 4; j++) actualRPM[j] = fabsf(enc[j].rpm);

  float avgLeft  = (actualRPM[0] + actualRPM[1]) / 2.0f;
  float avgRight = (actualRPM[2] + actualRPM[3]) / 2.0f;
  float avgTotal = (avgLeft + avgRight) / 2.0f;

  // Khóa đồng tốc vi sai Trái - Phải tức thời khi chạy thẳng
  float lrDiff = 0.0f;
  if (currentDirection == "ROS") {
    // Chỉ kích hoạt khóa đồng tốc khi ROS thực sự ra lệnh đi thẳng (chênh lệch < 0.1 RPM)
    // Tránh cản trở khi Nav2/AI đang chủ động điều khiển góc quay Wz nhỏ
    if (fabsf(rosTargetRpmSigned[0] - rosTargetRpmSigned[2]) < 0.1f) {
      lrDiff = avgLeft - avgRight;
    }
  } else if (currentDirection == "FORWARD" || currentDirection == "BACKWARD") {
    lrDiff = avgLeft - avgRight;
  }
  float lrCorrection = constrain(lrDiff * K_LR_BALANCE, -18.0f, 18.0f);

  for (int i = 0; i < 4; i++) {
#if WHEEL3_ENCODER_FAULT
    if (i == 3) {
      wpid[3].pwmOutput     = wpid[2].pwmOutput;
      wpid[3].prevPwmOutput = wpid[2].prevPwmOutput;
      slew[3].target        = slew[2].target;
      continue;
    }
#endif
    if (!wpid[i].enabled) continue;

    float rpm_act = actualRPM[i];
    float target  = wpid[i].targetRPM;
    bool  isLeft  = (i == 0 || i == 1);

    if (target <= 0.1f) {
      wpid[i].pwmOutput = 0; wpid[i].integral = 0; slew[i].target = 0;
      continue;
    }

    // 1. Feedforward có bù ma sát tĩnh (Deadband Friction Offset cho động cơ 775)
    float ff_pwm = 36.0f + (target / 220.0f) * (255.0f - 36.0f);

    // 2. Sai số bám tốc độ mục tiêu
    float track_error = target - rpm_act;
    if (fabsf(track_error) < PID_ERROR_DEADBAND) {
      track_error = 0.0f;
    }

    // 3. Sai số đồng tốc Cross-Coupling 4 bánh
    float sync_error = 0.0f;
    if ((currentDirection == "ROS" && fabsf(rosTargetRpmSigned[0] - rosTargetRpmSigned[2]) < 0.1f) ||
        currentDirection == "FORWARD" || currentDirection == "BACKWARD") {
      sync_error = (avgTotal - rpm_act);
    }

    // 4. Sai số tổng hợp đưa vào khâu PID
    float total_error = track_error + (sync_error * K_SYNC_CROSS_WHEEL);

    // 5. Khâu tích phân (Integral) có Anti-Windup thích ứng
    float maxIntegral = (target <= 65.0f) ? 50.0f : 100.0f;
    wpid[i].integral = constrain(wpid[i].integral + total_error * dt, -maxIntegral, maxIntegral);

    // 6. Khâu vi phân (Derivative) có lọc nhiễu
    float rawDeriv = (total_error - wpid[i].lastError) / dt;
    wpid[i].filteredDeriv = DERIVATIVE_FILTER * rawDeriv + (1.0f - DERIVATIVE_FILTER) * wpid[i].filteredDeriv;
    wpid[i].lastError = total_error;

    // 7. Tính toán PID cơ sở
    float pid_corr = (wpid[i].kp * total_error) + (wpid[i].ki * wpid[i].integral) + (wpid[i].kd * wpid[i].filteredDeriv);

    // 8. Bù cân bằng cụm Trái - Phải trực tiếp
    float balance_corr = isLeft ? (-lrCorrection) : (lrCorrection);

    // Đồng bộ nội bộ giữa 2 bánh cùng bên
    float side_sync = isLeft ? (avgLeft - rpm_act) : (avgRight - rpm_act);
    float internal_sync_corr = side_sync * 0.40f;

    // 9. Bù mô-men xoắn tốc độ thấp thích ứng tải
    float torque_boost = 0.0f;
    if (target < 75.0f && track_error > 1.0f) {
      float defectRatio = constrain(track_error / target, 0.0f, 1.0f);
      torque_boost = defectRatio * 35.0f;
    }

    // Ghì hãm chống vọt tốc khi chạy chậm
    if (rpm_act > target + 1.0f) {
      pid_corr -= (rpm_act - target) * 2.5f;
    }

    // 10. Tổng hợp PWM điều khiển hoàn chỉnh (0-255)
    int desired = constrain((int)(ff_pwm + pid_corr + balance_corr + internal_sync_corr + torque_boost), 0, 255);

    // Sàn PWM tối thiểu để động cơ 775 duy trì lăn bánh khi có lệnh chạy
    if (target > 1.0f && desired < 36) {
      desired = 36;
    }

    // Giới hạn an toàn thích ứng tải ở tốc độ thấp
    if (target <= 65.0f) {
      int safeLowSpeedCap = constrain((int)((target / 65.0f) * 140.0f + (track_error > 3.0f ? 50 : 0) + max(0.0f, wpid[i].integral * 0.8f)), 36, 255);
      if (rpm_act >= target * 0.90f && desired > safeLowSpeedCap) {
        desired = safeLowSpeedCap;
      }
    }

    // Giới hạn biến thiên PWM bất đối xứng
    int maxChange = (desired > wpid[i].prevPwmOutput) ? MAX_PWM_CHANGE_UP : MAX_PWM_CHANGE_DOWN;
    int delta   = constrain(desired - wpid[i].prevPwmOutput, -maxChange, maxChange);
    wpid[i].pwmOutput     = constrain(wpid[i].prevPwmOutput + delta, 0, 255);
    wpid[i].prevPwmOutput = wpid[i].pwmOutput;

    // Giảm tải cho bánh bị kẹt cứng
    if (wHealth[i].isStalled) {
      wpid[i].pwmOutput = max(0, wpid[i].pwmOutput - 50);
      wpid[i].integral = 0;
    }

    // Xác định chiều quay
    int sign = 0;
    if (currentDirection == "ROS")            sign = (rosTargetRpmSigned[i] >= 0.0f) ? 1 : -1;
    else if (currentDirection == "FORWARD")   sign = 1;
    else if (currentDirection == "BACKWARD")  sign = -1;
    else if (currentDirection == "LEFT")      sign = isLeft ? -1 : 1;
    else if (currentDirection == "RIGHT")     sign = isLeft ? 1 : -1;

    slew[i].target = sign * wpid[i].pwmOutput;
  }
}

