vinhlephu-lpv/robot-ws/src/esp32_source/code0409/code0409.ino
// ============================================================
//  9. SLEW RATE LIMITER — KHỞI ĐỘNG MỀM (40 Hz)
// ============================================================
void updateSpeedRamp() {
  unsigned long now = millis();
  if (now - lastRampTime < RAMP_INTERVAL_MS) return;
  lastRampTime = now;

  for (int i = 0; i < 4; i++) {
    float &cur  = slew[i].current;
    int    tgt  = slew[i].target;
    float &step = slew[i].step;

    if (tgt == 0) {
      step = constrain(abs(cur) / 8.0f, RAMP_STEP_MIN, RAMP_STEP_STOP_MAX);
    } else {
      if (currentDirection == "ROS") {
        step = 25.0f; // Chế độ ROS: bám sát lệnh điều khiển của Pi, giảm trễ đáp ứng
      } else {
        step = constrain(abs((float)tgt - cur) / 40.0f, RAMP_STEP_MIN, RAMP_STEP_MAX);
      }
    }

    if (abs((float)tgt - cur) <= step) cur = (float)tgt;
    else if (cur < (float)tgt)         cur += step;
    else                               cur -= step;
  }

  writeSingleDrive(DRV1_RPWM, DRV1_LPWM, CH_DRV1_F, CH_DRV1_R, (int)slew[0].current, INV_DRV1);
  writeSingleDrive(DRV2_RPWM, DRV2_LPWM, CH_DRV2_F, CH_DRV2_R, (int)slew[1].current, INV_DRV2);
  writeSingleDrive(DRV3_RPWM, DRV3_LPWM, CH_DRV3_F, CH_DRV3_R, (int)slew[2].current, INV_DRV3);
  writeSingleDrive(DRV4_RPWM, DRV4_LPWM, CH_DRV4_F, CH_DRV4_R, (int)slew[3].current, INV_DRV4);
}

// ============================================================
//  10. DỪNG XE & CẬP NHẬT TỐC ĐỘ XE
// ============================================================
void stopMotor(bool emergency) {
  currentDirection = "STOP";

  for (int i = 0; i < 4; i++) {
    slew[i].target = 0;
    wpid[i].targetRPM = 0.0f;
    wpid[i].integral = 0;
    wpid[i].lastError = 0;
    wpid[i].filteredDeriv = 0;
    wpid[i].pwmOutput = 0;
    wpid[i].prevPwmOutput = 0;
    rosTargetRpmSigned[i] = 0.0f;
  }

  if (emergency) {
    for (int i = 0; i < 4; i++) slew[i].current = 0.0f;
    writeAllDrives(0, 0, 0, 0);
    isMoving = false;
    Serial.println("# [ESTOP] DUNG KHAN CAP - NGAT DIEN TUC THI!");
  }
}

void stopMotor() {
  stopMotor(false);
}

void setVehicleSpeed(int spd) {
  currentSpeed = constrain(spd, 0, 255);
  if (currentSpeed == 0) {
    stopMotor(false);
    return;
  }
  globalTargetRPM = (currentSpeed / 255.0f) * 220.0f;
  for (int i = 0; i < 4; i++) {
    wpid[i].targetRPM = globalTargetRPM;
  }
}

// ============================================================
//  11. XỬ LÝ LỆNH SERIAL (LỆNH IP & LỆNH ĐIỀU KHIỂN)
// ============================================================
void handleCommand(String command) {
  command.trim();
  if (command.length() == 0) return;

  // Lệnh kiểm tra IP kết nối từ Serial Monitor: "IP"
  if (command.equalsIgnoreCase("IP")) {
    Serial.println();
    Serial.println("=========================================");
    if (WiFi.status() == WL_CONNECTED) {
      Serial.print  ("  >> IP XE THUC TE : ");
      Serial.println(WiFi.localIP());
      Serial.printf ("  >> WiFi SSID     : %s (RSSI: %d dBm)\n", WiFi.SSID().c_str(), WiFi.RSSI());
    } else {
      Serial.println("  [CHUA CO IP] Xe chua ket noi WiFi!");
      Serial.printf ("  SSID dang cau hinh: '%s'\n", ssid);
    }
    Serial.println("=========================================\n");
    return;
  }

  // Lệnh vận tốc ROS 2: "V <FL> <RL> <FR> <RR>" hoặc "V <L> <R>" (RPM)
  if (command.startsWith("V ") || command.startsWith("v ") || command.startsWith("V\t") || command.startsWith("v\t")) {
    float r[4] = {0.0f, 0.0f, 0.0f, 0.0f};
    int parsed = sscanf(command.c_str() + 2, "%f %f %f %f", &r[0], &r[1], &r[2], &r[3]);
    if (parsed == 2) {
      r[3] = r[1]; // Bánh phải sau = Bánh phải trước
      r[2] = r[1];
      r[1] = r[0]; // Bánh trái sau = Bánh trái trước
      parsed = 4;
    }
    if (parsed == 4) {
      lastRosCmdTime = millis();
      if (fabsf(r[0]) < 0.1f && fabsf(r[1]) < 0.1f && fabsf(r[2]) < 0.1f && fabsf(r[3]) < 0.1f) {
        stopMotor(false);
      } else {
        isMoving = true;
        currentDirection = "ROS";
        for (int i = 0; i < 4; i++) {
          rosTargetRpmSigned[i] = r[i];
          wpid[i].targetRPM = fabsf(r[i]);
          wpid[i].enabled = pidGlobalEnabled;
        }
      }
      return;
    }
  }

  // Lệnh Reset Odometry
  if (command.equalsIgnoreCase("RESET_ODOM") || command.equalsIgnoreCase("ZERO") || command.equalsIgnoreCase("RESET")) {
    for (int i = 0; i < 4; i++) {
      enc[i].count = 0;
      enc[i].distance_m = 0.0f;
      enc[i].lastSpeedCount = 0;
    }
    Serial.println("# [ODOM] Da reset toan bo xung va quang duong ve 0.00m");
    return;
  }

  // Lệnh PID: Luôn giữ PID bật cố định để đảm bảo đồng tốc 4 bánh chính xác
  if (command.equalsIgnoreCase("PID 1") || command.equalsIgnoreCase("PID ON")) {
    pidGlobalEnabled = true;
    for (int i = 0; i < 4; i++) wpid[i].enabled = true;
    Serial.println("# [MODE] PID: ON (Luon bat)");
    return;
  }
  if (command.equalsIgnoreCase("PID 0") || command.equalsIgnoreCase("PID OFF")) {
    // Luôn giữ PID bật theo yêu cầu hệ thống, không cho tắt để bảo vệ cân bằng 4 bánh
    pidGlobalEnabled = true;
    for (int i = 0; i < 4; i++) wpid[i].enabled = true;
    Serial.println("# [MODE] PID: LUON BAT (Locked ON - Khong the tat de giu dong toc)");
    return;
  }

  // Lệnh Dừng xe
  if (command.equalsIgnoreCase("STOP") || command.equalsIgnoreCase("X") || command == " ") {
    stopMotor(false);
    return;
  }
  if (command.equalsIgnoreCase("ESTOP") || command.equalsIgnoreCase("EMERGENCY_STOP")) {
    stopMotor(true);
    return;
  }

  // Lệnh chỉnh tốc độ: "SPEED <val>"
  if (command.startsWith("SPEED ") || command.startsWith("speed ")) {
    int spd = command.substring(6).toInt();
    if (spd > 0) {
      setVehicleSpeed(spd);
      Serial.printf("# [SPEED] Target RPM = %.1f (PWM %d)\n", globalTargetRPM, currentSpeed);
    }
    return;
  }

  // Lệnh test thủ công từ Serial Monitor: F (Tiến), B (Lùi), L (Trái), R (Phải)
  command.toUpperCase();
  if (command == "F" || command == "FORWARD") {
    currentDirection = "FORWARD";
    isMoving = true;
    for (int i = 0; i < 4; i++) wpid[i].targetRPM = globalTargetRPM;
    return;
  } else if (command == "B" || command == "BACKWARD") {
    currentDirection = "BACKWARD";
    isMoving = true;
    for (int i = 0; i < 4; i++) wpid[i].targetRPM = globalTargetRPM;
    return;
  } else if (command == "L" || command == "LEFT") {
    currentDirection = "LEFT";
    isMoving = true;
    for (int i = 0; i < 4; i++) wpid[i].targetRPM = globalTargetRPM;
    return;
  } else if (command == "R" || command == "RIGHT") {
    currentDirection = "RIGHT";
    isMoving = true;
    for (int i = 0; i < 4; i++) wpid[i].targetRPM = globalTargetRPM;
    return;
  }
}

